0.57.2119-1/DataProcessors/ККСНГ_СинхронизацияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ККСНГ_СинхронизацияКонтрагентов</Name>
			<Comment>Синхронизация контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильЭДООрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУчастникаЭДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>47</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЭДО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

0.57.2119-1/InformationRegisters/ККСНГ_Приглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Приглашения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IsLocal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderKpp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderInn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Side</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StatusName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AcceptionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AbonentCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverKpp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverInn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Contacts</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрофильЭДООрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/DataProcessors/ККСНГ_СинхронизацияКонтрагентов/Forms/Синхронизация/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрофильЭДООрганизации", Объект.ПрофильЭДООрганизации);
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(Объект.ПрофильЭДООрганизации, Элементы.ПрофильЭДООрганизации);
	
	ЭтотОбъект.ФильтрСтатусовВходящих = "processed";
	ЭтотОбъект.ФильтрСтатусовИсходящих = "processed";

	ЭтотОбъект.ПроверятьВзаимосвязи = Истина;

	ЭтотОбъект.СтатусВыполненияФоновогоЗадания = Новый Структура;
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("Описание", "");
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("КоличествоОбработанных", 0);
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("ОбщееКоличество", 100);
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("АдресВременногоХранилища", "");
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("ПрофильЭДООрганизации") Тогда
		Настройки.Удалить("Объект.ПрофильЭДООрганизации");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Проверка на доступность сохраненной в настройках организации
	Если ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) И Не ККСНГ_ОбщегоНазначенияВызовСервера.ПрофильЭДОДоступенПользователю(Объект.ПрофильЭДООрганизации) Тогда
		Объект.ПрофильЭДООрганизации = Неопределено;
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Контрагенты.Очистить();
	ПолучитьСпискиПолученныхОтправленных();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусовИсходящихПриИзменении(Элемент)
	
	ПолучитьСписокПриглашений(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусовВходящихПриИзменении(Элемент)
	
	ПолучитьСписокПолученныхПриглашений(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРазделовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		
		Если ТекущаяСтраница.Имя = "ГруппаИсходящиеПриглашения" Тогда
			ПолучитьСписокПриглашений(Неопределено);
		КонецЕсли;
		
		Если ТекущаяСтраница.Имя = "ГруппаВходящиеПриглашения" Тогда
			ПолучитьСписокПолученныхПриглашений(Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаСоответствияКонтрагентов

&НаКлиенте
Процедура ТаблицаКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перем Контрагент, КонтрагентЭДО;
	
	Контрагент = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элемент.ТекущиеДанные, "Контрагент");
	КонтрагентЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элемент.ТекущиеДанные, "КонтрагентЭДО");
	
	Если ЗначениеЗаполнено(КонтрагентЭДО) Тогда
		ККСНГ_ПриглашенияКлиент.ОткрытьФормуПрофиляКонтрагента(КонтрагентЭДО, ЭтотОбъект);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		ПоказатьЗначение(, Контрагент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПриглашенийОтправленные

&НаКлиенте
Процедура ОтправитьОбрабатыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПриглашенийОтправленные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Обрабатывать И Не (НРЕГ(ТекДанные.Status) = "processed" И НРЕГ(ТекДанные.Side) = "sender") Тогда
		ТекДанные.Обрабатывать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриглашенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеКонтрагенты1С = ВыбранноеЗначение;
	
	Если Не ВыбранныеКонтрагенты1С = Неопределено Тогда
		
		Если ВыбранныеКонтрагенты1С.Количество() > 1 Тогда
			
			ПараметрыОткрытия = Новый Структура("Контрагенты1С, ПрофильОрганизацииЭДО", ВыбранныеКонтрагенты1С, Объект.ПрофильЭДООрганизации);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаПриглашенийЗакрытие", ЭтотОбъект);
			
			ОткрытьФорму("Обработка.ККСНГ_СинхронизацияКонтрагентов.Форма.ОтправкаПриглашений", ПараметрыОткрытия, 
			Элементы.ТаблицаПриглашенийОтправленные, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ПослеАвторизации = Новый ОписаниеОповещения("ПригласитьКонтрагентовЗавершение", ЭтотОбъект, ВыбранныеКонтрагенты1С);
			ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийОтправленныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОтправитьReceiverName" И Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ПрофильКонтрагента = ККСНГ_РаботаСКонтрагентамиВызовСервера.ПрофильКонтрагента(Объект.ПрофильЭДООрганизации, Элемент.ТекущиеДанные.Контрагент);
		Если Не ПрофильКонтрагента.Пустая() Тогда
			ККСНГ_ПриглашенияКлиент.ОткрытьФормуПрофиляКонтрагента(ПрофильКонтрагента, Элементы.ТаблицаПриглашенийОтправленные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПриглашенийПринятые

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НРЕГ(ТекДанные.Side) = "receiver"
		И (НРЕГ(ТекДанные.Status) = "rejected" ИЛИ НРЕГ(ТекДанные.Status) = "accepted") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаПриглашенийПринятыеSenderName" 
		И Не Элемент.ТекущиеДанные = Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Профиль) Тогда
		ККСНГ_ПриглашенияКлиент.ОткрытьФормуПрофиляКонтрагента(Элемент.ТекущиеДанные.Профиль, Элементы.ТаблицаПриглашенийПринятые);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеОбрабатыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Обрабатывать Тогда
		Если НРЕГ(ТекДанные.Status) = "processed" и НРЕГ(ТекДанные.Side) = "receiver" Тогда
			
			ПутьКПолю = "ТаблицаПриглашенийПринятые[" + ТаблицаПриглашенийПринятые.Индекс(Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные) + "].Контрагент";
			Если Не ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
				ТекДанные.Обрабатывать = Ложь;
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен контрагент. Заполните контрагента и повторно примите приглашение", , ПутьКПолю);
			Иначе
				РеквизитыКонтрагента = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(ТекДанные.Контрагент, "ИНН, КПП");
				Если Не ТекДанные.SenderInn = РеквизитыКонтрагента["ИНН"] Или Не ТекДанные.SenderKpp = РеквизитыКонтрагента["КПП"] Тогда
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ИНН/КПП выбранного контрагента не совпадает с ИНН/КПП отправителя", , ПутьКПолю);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ТекДанные.Обрабатывать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	ОтправительИНН = ?(ТекДанные = Неопределено, "", ТекДанные.SenderInn);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИНН", ОтправительИНН);
	
	ПослеВыбораКонтрагента = Новый ОписаниеОповещения("ОбработкаВыбораПолучателя", ЭтотОбъект, Неопределено);
	
	ККСНГ_ПриглашенияКлиент.ОткрытьФормуВыбораКонтрагента(Отбор, Элементы.ТаблицаПриглашенийПринятые, ПослеВыбораКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеКонтрагентПриИзменении(Элемент, ВыбранныеЗначения = Неопределено)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		НовыйКонтрагент = ?(ВыбранныеЗначения = Неопределено, ТекДанные.Контрагент, ВыбранныеЗначения);
		ЗапросЗаписьПриглашения = ККСНГ_ПриглашенияВызовСервера.ЗаписатьКонтрагентаОтправителя(ТекДанные.Id, Объект.ПрофильЭДООрганизации, НовыйКонтрагент);
		Если Не ЗапросЗаписьПриглашения.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросЗаписьПриглашения.Журнал);			
		КонецЕсли;
		ТекДанные.Профиль = ККСНГ_РаботаСКонтрагентамиВызовСервера.ПрофильКонтрагента(Объект.ПрофильЭДООрганизации, НовыйКонтрагент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиКонтрагентов(Команда)
	
	ЭтотОбъект.КоличествоОбработанных = 0;
	ЭтотОбъект.ИнтервалОбновления = 0.8;
	
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("Описание", "Авторизация");
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("КоличествоОбработанных", 0);
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("ОбщееКоличество", 100);
	
	ЭтотОбъект.ЗаписыватьКонтрагентовПриПоиске = (СтрСравнить(Команда.Имя, "НайтиИЗаписатьКонтрагентов") = 0);
	ОбновитьКнопкуПоискаКонтрагентов();
	
	ПодключитьОбработчикОжидания("НачатьПолучениеПараметровАвторизации", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискКонтрагентов(Команда)
	
	ОтменитьПоискКонтрагентовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьВзаимосвязи(Команда)
	
	ЭтотОбъект.ПроверятьВзаимосвязи = Не ЭтотОбъект.ПроверятьВзаимосвязи;
	Элементы.КнопкаПроверятьВзаимосвязи.Пометка = ЭтотОбъект.ПроверятьВзаимосвязи;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборКонтрагентов(Команда)
	
	ОткрытьФорму("Обработка.ККСНГ_СинхронизацияКонтрагентов.Форма.НастройкаОтбораКонтрагентов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКонтрагентов(Команда)
	
	ЗаписатьКонтрагентовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЖурнал(Команда)
	
	Перем Журнал, ТекстовыйДокуумент;
	
	Журнал = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.РезультатОбработки, "Журнал");
	Если ТипЗнч(Журнал) = Тип("Массив") Тогда
		ТекстовыйДокумент = ККСНГ_ЛогированиеКлиентСервер.ПолучитьЖурналКакТекстовыйДокумент(Журнал);
		ТекстовыйДокумент.Показать("Журнал выполнения", "log.txt");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	УстановитьПометкуКонтрагентов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборВсех(Команда)
	
	УстановитьПометкуКонтрагентов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПриглашений(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "Объект.ПрофильЭДООрганизации");
		Возврат;
	КонецЕсли;
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Sender");
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПолученныхПриглашений(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "Объект.ПрофильЭДООрганизации");
		Возврат;
	КонецЕсли;
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Receiver");
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПригласитьКонтрагентов(Команда)
	
	Если Элементы.ПригласитьКонтрагентов.Доступность = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильЭДООрганизации", "Объект");
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Истина, Истина);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыПодбора, Элементы.ТаблицаПриглашенийОтправленные, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьПриглашения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильЭДООрганизации", "Объект");
		Возврат;
	КонецЕсли;
	
	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийОтправленные);
	Если ИДПриглашений.Количество() > 0 Тогда
		Элементы.ОтозватьПриглашения.Доступность = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ОтозватьПриглашениеЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьПриглашения(Команда)
	
	Если Элементы.ПринятьПриглашения.Доступность = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильЭДООрганизации", "Объект");
		Возврат;
	КонецЕсли;
	
	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийПринятые);
	Если ИДПриглашений.Количество() > 0 Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПрофильЭДООрганизации", Объект.ПрофильЭДООрганизации);
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ПринятьПриглашенияЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПриглашения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильЭДООрганизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильЭДООрганизации", "Объект");
		Возврат;
	КонецЕсли;
	
	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийПринятые);
	Если ИДПриглашений.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ОтклонитьПриглашенияЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоискКонтрагентов

&НаСервере
Процедура ОбновитьКнопкуПоискаКонтрагентов(ИмяКоманды = "")
	
	Если ПустаяСтрока(ИмяКоманды) Тогда
		ИмяКоманды = ?(ЭтотОбъект.ЗаписыватьКонтрагентовПриПоиске, "НайтиИЗаписатьКонтрагентов", "НайтиКонтрагентов");
	КонецЕсли;
	Элементы.КнопкаНайтиОбщая.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Перем Журнал, ФоновоеЗаданиеАктивно, Элемент;
	
	// Кнопка поиска контрагентов по умолчанию
	ОбновитьКнопкуПоискаКонтрагентов();
	
	// Настройка поиска с учетом взаимосвязей
	Элементы.КнопкаПроверятьВзаимосвязи.Пометка = ЭтотОбъект.ПроверятьВзаимосвязи;
	
	// Просмотр журнала
	Журнал = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.РезультатОбработки, "Журнал");
	Элементы.КнопкаПоказатьЖурнал.Видимость = (ТипЗнч(Журнал) = Тип("Массив"));
	
	// Режим ожидания фонового задания
	ФоновоеЗаданиеАктивно = ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторФоновогоЗадания);
	ЭтотОбъект.ТолькоПросмотр = ФоновоеЗаданиеАктивно;
	
	Если ФоновоеЗаданиеАктивно И Элементы.Разделы.ТекущаяСтраница <> Элементы.Контрагенты Тогда
		Элементы.Разделы.ТекущаяСтраница = Элементы.Контрагенты;
	КонецЕсли;
	
	Элементы.ПрофильЭДООрганизации.Доступность = Не ФоновоеЗаданиеАктивно;
	Элементы.ТаблицаКонтрагентов.Доступность = Не ФоновоеЗаданиеАктивно;
	Элементы.ХодВыполненияФоновогоЗадания.Видимость = ФоновоеЗаданиеАктивно;
	
	Для каждого Элемент Из Элементы.Разделы.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = (Элемент = Элементы.Контрагенты) Или (Не ФоновоеЗаданиеАктивно);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеПараметровАвторизации() Экспорт
	
	Перем ОписаниеОповещения;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияПараметровАвторизации", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияПараметровАвторизации(ЗапросПараметровАвторизации, ДополнительныеПараметры) Экспорт
	
	Если ЗапросПараметровАвторизации.Успех Тогда
		
		ЗапуститьПоискКонтрагентовНаСервере(ЗапросПараметровАвторизации.Результат);
		Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторФоновогоЗадания) Тогда
			ЭтотОбъект.ИнтервалОбновления = 0.8;
			ПодключитьОбработчикОжидания("ОбновитьСтатусФоновогоЗадания", 0.1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьПоискКонтрагентовНаСервере(ПараметрыАвторизации)
	
	Перем КодУчастникаЭДО, КлючФоновогоЗадания, НаименованиеФоновогоЗадания;
	Перем Отбор, ЗапущенныеЗадания, ЗапущенноеЗадание;
	Перем ПараметрыВызова, ФоновоеЗадание;
	
	Объект.Контрагенты.Очистить();
	
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("Описание", "Подключение");
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("КоличествоОбработанных", 0);
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("ОбщееКоличество", 100);
	
	КодУчастникаЭДО = СокрЛП(Объект.ПрофильЭДООрганизации.КодУчастникаЭДО);
	КлючФоновогоЗадания = СтрШаблон("ПоискКонтрагентовЭДО_%1", КодУчастникаЭДО);
	НаименованиеФоновогоЗадания = СтрШаблон("Поиск контрагентов ЭДО (%1)", Объект.ПрофильЭДООрганизации.Наименование);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючФоновогоЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ЗапущенныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Для каждого ЗапущенноеЗадание Из ЗапущенныеЗадания Цикл
		ЭтотОбъект.ИдентификаторФоновогоЗадания = ЗапущенноеЗадание.УникальныйИдентификатор;
		Возврат;
	КонецЦикла;
	
	ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Вставить("Описание", "Ожидание запуска");
	ЭтотОбъект.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыАвторизации);
	ПараметрыВызова.Добавить(Объект.ПрофильЭДООрганизации);
	ПараметрыВызова.Добавить(ЭтотОбъект.АдресВременногоХранилища);
	ПараметрыВызова.Добавить(ЭтотОбъект.ЗаписыватьКонтрагентовПриПоиске);
	ПараметрыВызова.Добавить(ЭтотОбъект.ПроверятьВзаимосвязи);
	ПараметрыВызова.Добавить(Объект.Контрагенты.Выгрузить(Новый Массив).СкопироватьКолонки());
	
	Попытка
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_РаботаСКонтрагентамиВызовСервера.СинхронизироватьНовыхКонтрагентовФоном", ПараметрыВызова, КлючФоновогоЗадания, НаименованиеФоновогоЗадания);
		ЭтотОбъект.ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
		
	Исключение
		
		УдалитьИзВременногоХранилища(ЭтотОбъект.АдресВременногоХранилища);
		ЭтотОбъект.ИдентификаторФоновогоЗадания = Неопределено;
		ЭтотОбъект.АдресВременногоХранилища = "";
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПоискКонтрагентовНаСервере()
	
	Перем ФоновоеЗадание;
	
	Попытка
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторФоновогоЗадания) Тогда
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЭтотОбъект.ИдентификаторФоновогоЗадания);
			Если ФоновоеЗадание <> Неопределено Тогда
				ФоновоеЗадание.Отменить();
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусФоновогоЗадания() Экспорт
	
	Перем ФоновоеЗаданиеЗавершено;
	Перем КонтрагентовНайдено;
	Перем ТекстСообщения;
	Перем ОшибкаЖурнала;
	
	ОтключитьОбработчикОжидания("ОбновитьСтатусФоновогоЗадания");
	
	Если ЭтотОбъект.ИнтервалОбновления < 0.8 Тогда
		ЭтотОбъект.ИнтервалОбновления = 0.8
	КонецЕсли;
	ЭтотОбъект.ИнтервалОбновления = ЭтотОбъект.ИнтервалОбновления * 1.4;
	Если ЭтотОбъект.ИнтервалОбновления > 5 Тогда
		ЭтотОбъект.ИнтервалОбновления = 5;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторФоновогоЗадания) Тогда
		
		ОбновитьСтатусФоновогоЗаданияНаСервере(ЭтотОбъект.ИдентификаторФоновогоЗадания, ФоновоеЗаданиеЗавершено, ЭтотОбъект.СтатусВыполненияФоновогоЗадания);
		ЭтотОбъект.СтатусФоновогоЗадания = ЭтотОбъект.СтатусВыполненияФоновогоЗадания.Описание;
		ЭтотОбъект.КоличествоОбработанных = ЭтотОбъект.СтатусВыполненияФоновогоЗадания.КоличествоОбработанных;
		Элементы.ИндикаторФоновогоЗадания.МаксимальноеЗначение = ЭтотОбъект.СтатусВыполненияФоновогоЗадания.ОбщееКоличество;
		Если ЭтоАдресВременногоХранилища(ЭтотОбъект.СтатусВыполненияФоновогоЗадания.АдресВременногоХранилища) Тогда
			ЭтотОбъект.АдресВременногоХранилища = ЭтотОбъект.СтатусВыполненияФоновогоЗадания.АдресВременногоХранилища;
		КонецЕсли;
		
		Если ФоновоеЗаданиеЗавершено = Истина Тогда
			
			ЗагрузитьРезультатПоискаКонтрагентовНаСервере();
			ЭтотОбъект.ИдентификаторФоновогоЗадания = Неопределено;
			ЭтотОбъект.АдресВременногоХранилища = "";
			ОбновитьОтображениеЭлементовФормы();
			
			КонтрагентовНайдено = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.РезультатОбработки, "Результат.КонтрагентовНайдено");
			КонтрагентовНайдено = ?(ТипЗнч(КонтрагентовНайдено) = Тип("Число"), КонтрагентовНайдено, 0);
			
			Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.РезультатОбработки, "Успех") = Истина Тогда
				ТекстСообщения = СтрШаблон("Найдено новых: %1.", Формат(КонтрагентовНайдено, "ЧН=0; ЧГ=0"))
			Иначе
				Если Объект.Контрагенты.Количество() > 0 Тогда
					ТекстСообщения = СтрШаблон("Найдено новых: %1" + Символы.ПС + "При поиске произошли ошибки.", Формат(КонтрагентовНайдено, "ЧН=0; ЧГ=0"))
				Иначе
					ТекстСообщения = "Поиск завершился с ошибками.";
				КонецЕсли;
			КонецЕсли;
			Состояние("Поиск контрагентов", , ТекстСообщения);
			
			// Проверка ситуации, когда истек срок действия AuthCookie при работе с токеном Сбербанка
			ОшибкаЖурнала = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЭтотОбъект.РезультатОбработки.Журнал, "AU-00002");
			Если ОшибкаЖурнала <> Неопределено И ОшибкаЖурнала.КодОшибки = "AU-00002" Тогда
				ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, Новый Структура("НеобходимаПереинициализация", Истина));
			КонецЕсли;
			
		Иначе
			ПодключитьОбработчикОжидания("ОбновитьСтатусФоновогоЗадания", ЭтотОбъект.ИнтервалОбновления, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусФоновогоЗаданияНаСервере(ИдентификаторФоновогоЗадания, ФоновоеЗаданиеЗавершено, СтатусВыполненияЗадания)
	
	Перем ФоновоеЗадание, СтатусВыполнения;
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		
		ФоновоеЗаданиеЗавершено = ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно;
		
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
		Если СообщенияПользователю.Количество() > 0 Тогда
			Попытка
				СтатусВыполнения = ЗначениеИзСтрокиВнутр(СообщенияПользователю[СообщенияПользователю.ВГраница()].Текст);
				Если ТипЗнч(СтатусВыполнения) = Тип("Структура") Тогда
					ЗаполнитьЗначенияСвойств(СтатусВыполненияЗадания, СтатусВыполнения);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		
		ИдентификаторФоновогоЗадания = Неопределено;
		ФоновоеЗаданиеЗавершено = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультатПоискаКонтрагентовНаСервере()
	
	Перем РезультатОбработки, ТаблицаКонтрагентов, Журнал;
	Перем СтрокаТаблицы, НоваяСтрока;
	Перем ФоновоеЗадание, ИнформацияОбОшибке;
	Перем КонтрагентовВсего, КонтрагентовНайдено;
	
	ЭтотОбъект.РезультатОбработки = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение данных от фонового задания");
	
	КонтрагентовВсего = 0;
	КонтрагентовНайдено = 0;
	
	Объект.Контрагенты.Очистить();
	
	// Поиск ошибки фонового задания
	Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторФоновогоЗадания) Тогда
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЭтотОбъект.ИдентификаторФоновогоЗадания);
		Если ФоновоеЗадание <> Неопределено Тогда
			ИнформацияОбОшибке = ФоновоеЗадание.ИнформацияОбОшибке;
			Если ИнформацияОбОшибке <> Неопределено Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЭтотОбъект.РезультатОбработки.Журнал, "Фоновое задание завершено с ошибкой", "RI-00001", ИнформацияОбОшибке.Описание);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Получение результата фонового задания
	Если ЭтоАдресВременногоХранилища(ЭтотОбъект.АдресВременногоХранилища) Тогда
		РезультатОбработки = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресВременногоХранилища);
		УдалитьИзВременногоХранилища(ЭтотОбъект.АдресВременногоХранилища);
	КонецЕсли;
	
	Если ТипЗнч(РезультатОбработки) <> Тип("Структура") Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЭтотОбъект.РезультатОбработки.Журнал, "Не удалось получить результат из временного хранилища", "RI-00002");
		
	Иначе
		
		// Обработка результата
		ТаблицаКонтрагентов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОбработки, "Результат");
		
		Если ТипЗнч(ТаблицаКонтрагентов) = Тип("ТаблицаЗначений") Тогда
			
			КонтрагентовВсего = ТаблицаКонтрагентов.Количество();
			Для каждого СтрокаТаблицы Из ТаблицаКонтрагентов Цикл
				НоваяСтрока = Объект.Контрагенты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонтрагентовНайдено = КонтрагентовНайдено + ?(ЗначениеЗаполнено(НоваяСтрока.КодУчастникаЭДО), 1, 0);
			КонецЦикла;
			
		КонецЕсли;
		
		// Обработка журнала
		Журнал = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОбработки, "Журнал");
		Если ТипЗнч(Журнал) = Тип("Массив") Тогда
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(ЭтотОбъект.РезультатОбработки.Журнал, Журнал, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.РезультатОбработки.Результат = Новый Структура;
	ЭтотОбъект.РезультатОбработки.Результат.Вставить("КонтрагентовВсего", КонтрагентовВсего);
	ЭтотОбъект.РезультатОбработки.Результат.Вставить("КонтрагентовНайдено", КонтрагентовНайдено);
	
	ЭтотОбъект.РезультатОбработки.Успех = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЭтотОбъект.РезультатОбработки.Журнал) = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуКонтрагентов(Пометка)
	
	Перем СтрокаТаблицы;
	
	Для каждого СтрокаТаблицы Из Объект.Контрагенты Цикл
		СтрокаТаблицы.Пометка = Пометка И ЗначениеЗаполнено(СтрокаТаблицы.КодУчастникаЭДО) И Не ЗначениеЗаполнено(СтрокаТаблицы.КонтрагентЭДО);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонтрагентовНаСервере()
	
	Перем СтрокаТаблицы;
	
	ЭтотОбъект.РезультатОбработки = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись настроек контрагентов ЭДО");
	
	Для каждого СтрокаТаблицы Из Объект.Контрагенты Цикл
		Если СтрокаТаблицы.Пометка И ЗначениеЗаполнено(СтрокаТаблицы.КодУчастникаЭДО) И Не ЗначениеЗаполнено(СтрокаТаблицы.КонтрагентЭДО) Тогда
			
			ЗаписьКонтрагента = ККСНГ_РаботаСКонтрагентамиВызовСервера.ЗаписатьКонтрагентаЭДО(СтрокаТаблицы.Организация, СтрокаТаблицы.Контрагент, СтрокаТаблицы.КодУчастникаЭДО, СтрокаТаблицы.ИдентификаторСК);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(ЭтотОбъект.РезультатОбработки.Журнал, ЗаписьКонтрагента.Журнал, Ложь);
			
			Если ЗаписьКонтрагента.Успех Тогда
				СтрокаТаблицы.КонтрагентЭДО = ЗаписьКонтрагента.Результат;
			КонецЕсли;
			
			СтрокаТаблицы.Пометка = Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ИДВыделенныхПриглашений(ТекущаяТаблица = Неопределено)
	
	ИДПриглашений = Новый Массив;
	
	Если Не ТекущаяТаблица = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			Если ТекущаяСтрока.Обрабатывать Тогда
				ИДПриглашений.Добавить(ТекущаяСтрока.Id);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ИДПриглашений;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораПолучателя(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		
		ТаблицаПриглашенийПринятыеКонтрагентПриИзменении(Неопределено, ВыбранноеЗначение);
		
		ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.Контрагент = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПоследнююОшибкуЖурнала(ЖурналСобытий)
	
	ПоследняяОшибкаЖурнала = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЖурналСобытий);
	
	Если Не ПоследняяОшибкаЖурнала = Неопределено Тогда
		ПоказатьОповещениеПользователя(, , ПоследняяОшибкаЖурнала.Событие);
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСПриглашениями

#Область ПолучениеПриглашений

&НаКлиенте
Процедура ПолучитьСпискиПолученныхОтправленных()
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСпискиПолученныхОтправленныхЗавершение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСпискиПолученныхОтправленныхЗавершение(ЗапросПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ОбновитьТекущиеПриглашения();
		Если ОбновлениеПриглашений.Успех Тогда
			
			КоличествоНовыхПрофилей = ОбновлениеПриглашений.Результат.КоличествоНовыхПрофилей;
			КоличествоНовыхПриглашений = ОбновлениеПриглашений.Результат.КоличествоНовыхПриглашений;
			Если Не КоличествоНовыхПрофилей = 0 ИЛИ Не КоличествоНовыхПриглашений = 0 Тогда
				Пояснение = "Получено новых приглашений - " + КоличествоНовыхПриглашений + Символы.ПС + "Одобрено приглашений - " + КоличествоНовыхПрофилей;
				ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
			КонецЕсли;
			
		Иначе 
			
			ВывестиПоследнююОшибкуЖурнала(ОбновлениеПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПриглашенийЗавершение(ЗапросПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ОбновитьТекущиеПриглашения(?(ДопПараметры = Неопределено, "", ДопПараметры));
		Если ОбновлениеПриглашений.Успех Тогда
			
			КоличествоНовыхПрофилей = ОбновлениеПриглашений.Результат.КоличествоНовыхПрофилей;
			КоличествоНовыхПриглашений = ОбновлениеПриглашений.Результат.КоличествоНовыхПриглашений;
			Если Не КоличествоНовыхПрофилей = 0 ИЛИ Не КоличествоНовыхПриглашений = 0 Тогда
				Пояснение = "Получено новых приглашений - " + КоличествоНовыхПриглашений + Символы.ПС + "Одобрено приглашений - " + КоличествоНовыхПрофилей;
				ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
			КонецЕсли;
			
		Иначе 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОбновлениеПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущиеПриглашения(НаправлениеЗапроса = Неопределено)
	
	Если НаправлениеЗапроса = Неопределено Тогда
		ТаблицаОтправленные = ПолучитьТекущиеПриглашенияКакОтправитель(Объект.ПрофильЭДООрганизации, НРЕГ(ФильтрСтатусовИсходящих));
		ЗначениеВРеквизитФормы(ТаблицаОтправленные, "ТаблицаПриглашенийОтправленные");
		
		ТаблицаПринятые = ПолучитьТекущиеПриглашенияКакПолучатель(Объект.ПрофильЭДООрганизации, НРЕГ(ФильтрСтатусовВходящих));
		ЗначениеВРеквизитФормы(ТаблицаПринятые, "ТаблицаПриглашенийПринятые");
		
	ИначеЕсли НаправлениеЗапроса = "Sender" Тогда
		ТаблицаОтправленные = ПолучитьТекущиеПриглашенияКакОтправитель(Объект.ПрофильЭДООрганизации, НРЕГ(ФильтрСтатусовИсходящих));
		ЗначениеВРеквизитФормы(ТаблицаОтправленные, "ТаблицаПриглашенийОтправленные");
		
	ИначеЕсли НаправлениеЗапроса = "Receiver" Тогда	
		ТаблицаПринятые = ПолучитьТекущиеПриглашенияКакПолучатель(Объект.ПрофильЭДООрганизации, НРЕГ(ФильтрСтатусовВходящих));
		ЗначениеВРеквизитФормы(ТаблицаПринятые, "ТаблицаПриглашенийПринятые");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущиеПриглашенияКакПолучатель(ПрофильНастройкиЭДО, ВыбранныйСтатус)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	РегистрСведенийККСНГ_Приглашения.Обработано КАК Обработано,
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.SenderName КАК SenderName,
	|	РегистрСведенийККСНГ_Приглашения.SenderKpp КАК SenderKpp,
	|	РегистрСведенийККСНГ_Приглашения.SenderInn КАК SenderInn,
	|	РегистрСведенийККСНГ_Приглашения.Status КАК Status,
	|	РегистрСведенийККСНГ_Приглашения.Date КАК Date,
	|	РегистрСведенийККСНГ_Приглашения.AcceptionDate КАК AcceptionDate,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverId КАК ReceiverId,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverName КАК ReceiverName,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.Contacts КАК Contacts,
	|	РегистрСведенийККСНГ_Приглашения.Email КАК Email,
	|	ЛОЖЬ КАК Обрабатывать,
	|	РегистрСведенийККСНГ_Приглашения.Side КАК Side,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентОтправитель КАК КонтрагентОтправитель,
	|	РегистрСведенийККСНГ_Приглашения.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильНастройкиЭДО
	|	И РегистрСведенийККСНГ_Приглашения.Side = &Side
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтр
	|				ТОГДА РегистрСведенийККСНГ_Приглашения.Status = &ВыбранныйСтатус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Количество,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП
	|ПОМЕСТИТЬ КоличествоКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН В
	|			(ВЫБРАТЬ
	|				Т.SenderInn
	|			ИЗ
	|				ДанныеРегистра КАК Т)
	|	И НЕ Контрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеРегистра.Обработано КАК Обработано,
	|	ДанныеРегистра.Id КАК Id,
	|	ДанныеРегистра.SenderName КАК SenderName,
	|	ДанныеРегистра.SenderKpp КАК SenderKpp,
	|	ДанныеРегистра.SenderInn КАК SenderInn,
	|	ДанныеРегистра.Status КАК Status,
	|	ДанныеРегистра.Date КАК Date,
	|	ДанныеРегистра.AcceptionDate КАК AcceptionDate,
	|	ДанныеРегистра.ReceiverId КАК ReceiverId,
	|	ДанныеРегистра.ReceiverName КАК ReceiverName,
	|	ДанныеРегистра.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеРегистра.ReceiverInn КАК ReceiverInn,
	|	ДанныеРегистра.Contacts КАК Contacts,
	|	ДанныеРегистра.Email КАК Email,
	|	ДанныеРегистра.Обрабатывать КАК Обрабатывать,
	|	КоличествоКонтрагентов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|				И КоличествоКонтрагентов.Количество = 1
	|				И (ДанныеРегистра.Status = ""processed"" ИЛИ ДанныеРегистра.Status = ""Accepted"")
	|				И ДанныеРегистра.Side = ""Receiver""
	|			ТОГДА Контрагенты.Ссылка
	|		КОГДА НЕ ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|			ТОГДА ДанныеРегистра.КонтрагентОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|	КОНЕЦ КАК КонтрагентОтправитель,
	|	ДанныеРегистра.Side КАК Side,
	|	ДанныеРегистра.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеСКонтрагентом
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоКонтрагентов КАК КоличествоКонтрагентов
	|		ПО ДанныеРегистра.SenderInn = КоличествоКонтрагентов.ИНН
	|			И ДанныеРегистра.SenderKpp = КоличествоКонтрагентов.КПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеРегистра.SenderInn = Контрагенты.ИНН
	|			И ДанныеРегистра.SenderKpp = Контрагенты.КПП
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано КАК Обработано,
	|	ДанныеСКонтрагентом.Id КАК Id,
	|	ДанныеСКонтрагентом.SenderName КАК SenderName,
	|	ДанныеСКонтрагентом.SenderKpp КАК SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn КАК SenderInn,
	|	ДанныеСКонтрагентом.Status КАК Status,
	|	ДанныеСКонтрагентом.Date КАК Date,
	|	ДанныеСКонтрагентом.AcceptionDate КАК AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId КАК ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName КАК ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn КАК ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts КАК Contacts,
	|	ДанныеСКонтрагентом.Email КАК Email,
	|	ДанныеСКонтрагентом.Обрабатывать КАК Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (ДанныеСКонтрагентом.Status = ""processed""
	|					ИЛИ ДанныеСКонтрагентом.Status = ""Accepted"")
	|						И ДанныеСКонтрагентом.Side = ""Receiver""
	|				ТОГДА ККСНГ_Контрагенты.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(справочник.ККСНГ_Контрагенты.пустаяСсылка)
	|		КОНЕЦ) КАК Профиль,
	|	ДанныеСКонтрагентом.StatusName КАК StatusName,
	|	ДанныеСКонтрагентом.Side КАК Side
	|ИЗ
	|	ДанныеСКонтрагентом КАК ДанныеСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ПО ДанныеСКонтрагентом.КонтрагентОтправитель = ККСНГ_Контрагенты.Контрагент
	|			И (НЕ ККСНГ_Контрагенты.ПометкаУдаления)
	|			И ДанныеСКонтрагентом.ПрофильЭДООрганизации = ККСНГ_Контрагенты.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано,
	|	ДанныеСКонтрагентом.Id,
	|	ДанныеСКонтрагентом.SenderName,
	|	ДанныеСКонтрагентом.SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn,
	|	ДанныеСКонтрагентом.Status,
	|	ДанныеСКонтрагентом.Date,
	|	ДанныеСКонтрагентом.AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts,
	|	ДанныеСКонтрагентом.Email,
	|	ДанныеСКонтрагентом.Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель,
	|	ДанныеСКонтрагентом.StatusName,
	|	ДанныеСКонтрагентом.Side";
	
	Запрос.УстановитьПараметр("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	Запрос.УстановитьПараметр("side", "Receiver");
	
	Если Не ВыбранныйСтатус = "all" Тогда
		Запрос.УстановитьПараметр("ВыбранныйСтатус", ВыбранныйСтатус);
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Истина);
	Иначе	
		Запрос.УстановитьПараметр("ВыбранныйСтатус", "");
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Ложь);	
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущиеПриглашенияКакОтправитель(ПрофильНастройкиЭДО, ВыбранныйСтатус)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	РегистрСведенийККСНГ_Приглашения.Обработано КАК Обработано,
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.SenderName КАК SenderName,
	|	РегистрСведенийККСНГ_Приглашения.SenderKpp КАК SenderKpp,
	|	РегистрСведенийККСНГ_Приглашения.SenderInn КАК SenderInn,
	|	РегистрСведенийККСНГ_Приглашения.StatusName КАК StatusName,
	|	РегистрСведенийККСНГ_Приглашения.Date КАК Date,
	|	РегистрСведенийККСНГ_Приглашения.AcceptionDate КАК AcceptionDate,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverId КАК ReceiverId,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverName КАК ReceiverName,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.Contacts КАК Contacts,
	|	РегистрСведенийККСНГ_Приглашения.Email КАК Email,
	|	ЛОЖЬ КАК Обрабатывать,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель КАК Контрагент,
	|	РегистрСведенийККСНГ_Приглашения.Status КАК Status,
	|	РегистрСведенийККСНГ_Приглашения.Side КАК Side
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильНастройкиЭДО
	|	И РегистрСведенийККСНГ_Приглашения.Side = &Side
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтр
	|				ТОГДА РегистрСведенийККСНГ_Приглашения.Status = &ВыбранныйСтатус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	Запрос.УстановитьПараметр("side", "Sender");
	
	Если Не ВыбранныйСтатус = "all" Тогда
		Запрос.УстановитьПараметр("ВыбранныйСтатус", ВыбранныйСтатус);
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Истина);
	Иначе	
		Запрос.УстановитьПараметр("ВыбранныйСтатус", "");
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Ложь);	
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ПриглашениеКонтрагентов

&НаКлиенте
Процедура ПригласитьКонтрагентовЗавершение(ЗапросПараметрыАвторизации, ВыбранныеКонтрагенты1С) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		РезультатПроверки = ККСНГ_ПриглашенияВызовСервера.КонтрагентыЗарегистрированыВКурьере(ПараметрыАвторизации, ВыбранныеКонтрагенты1С);
		Если Не РезультатПроверки.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(РезультатПроверки.Журнал);
			Возврат;	
		КонецЕсли;
		
		ЗарегистрированныеКонтрагентыЭДО = РезультатПроверки.Результат.ЗарегистрированныеКонтрагентыЭДО;
		
		ОтправкаПриглашений = ККСНГ_ПриглашенияВызовСервера.ПригласитьКонтрагентов(ВыбранныеКонтрагенты1С, ЗарегистрированныеКонтрагентыЭДО, Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		
		Если ОтправкаПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отправлены");
			ОбновитьТекущиеПриглашения("Sender");
		Иначе 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтправкаПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПриглашенийЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ОбновитьСписокПриглашений", Ложь) Тогда
		ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Sender");
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Объект.ПрофильЭДООрганизации, ПослеАвторизации);
	КонецЕсли;
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ОткрытьВыборКонтрагентов", Ложь) Тогда
		ПригласитьКонтрагентов(Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтзывПриглашения

&НаКлиенте
Процедура ОтозватьПриглашениеЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ИДПриглашений = ДопПараметры.ИДПриглашений;
		ОтзывПриглашений = ККСНГ_ПриглашенияВызовСервера.ОтозватьПриглашение(ИДПриглашений, Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		
		Если ОтзывПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отозваны");
			ОбновитьТекущиеПриглашения("Sender");
		Иначе 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтзывПриглашений.Журнал);
			
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
	Элементы.ОтозватьПриглашения.Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПринятиеПриглашений

&НаКлиенте
Процедура ПринятьПриглашенияЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		РезультатОбработки = ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ДопПараметры.ИДПриглашений, ПараметрыАвторизации, ДопПараметры.ПрофильЭДООрганизации);
		
		Если РезультатОбработки.ИДПриглашений.Количество() > 0 Тогда
			
			ПринятиеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПринятьПриглашения(РезультатОбработки.ИДПриглашений, 
			ДопПараметры.ПрофильЭДООрганизации, ПараметрыАвторизации);
			
			КоличествоНовыхПрофилей = РезультатОбработки.КоличествоНовыхПрофилей;
			
			Если Не КоличествоНовыхПрофилей = 0 Тогда
				Пояснение = "Принято приглашений - " + КоличествоНовыхПрофилей;
				ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
			КонецЕсли;
			
			Если ПринятиеПриглашений.Успех Тогда
				ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
				ОбновитьТекущиеПриглашения("Receiver");
			Иначе 
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ПринятиеПриглашений.Журнал);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ИДПриглашений, ПараметрыАвторизации, ПрофильЭДООрганизации)
	
	ТаблицаПриглашений = РеквизитФормыВЗначение("ТаблицаПриглашенийПринятые");
	Возврат ККСНГ_ПриглашенияВызовСервера.ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ИДПриглашений, ТаблицаПриглашений, ПараметрыАвторизации, ПрофильЭДООрганизации);	
	
КонецФункции

#КонецОбласти

#Область ОтклонениеПриглашений

&НаКлиенте
Процедура ОтклонитьПриглашенияЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ИДПриглашений = ДопПараметры.ИДПриглашений;
		ОтклонениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ОтклонитьПриглашения(ИДПриглашений, Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		
		Если ОтклонениеПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отклонены");
			ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
			ОбновитьТекущиеПриглашения("Receiver");
		Иначе 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтклонениеПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Объект.ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура ДекорацияОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьОшибкиПолученияДанныхСервиса" Тогда
		
		ЖурналСообщений = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ЖурналСинхронизации, "Сообщения");
		
		Если Не ТипЗнч(ЖурналСообщений) = Тип("Массив") Тогда
			Сообщить("Ошибка получения журнала синхронизации данных по контрагентам.");
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		ТекстовыйДокумент = ККСНГ_ЛогированиеКлиентСервер.ПолучитьЖурналКакТекстовыйДокумент(ЖурналСообщений, "-1");
		ТекстовыйДокумент.Показать("Журнал синхронизации данных по контрагентам");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
